УТ.КонтурЗакупки/src/InformationRegisters/КонтурЗакупки_ПривязкаОбработкиЗакупки/КонтурЗакупки_ПривязкаОбработкиЗакупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЗакупки_ПривязкаОбработкиЗакупки</name>
  <resources>
    <name>ИдентификаторОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбработкаЗакупки</name>
    <type>
      <types>DocumentRef.КонтурЗакупки_ОбработкаЗакупки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.КонтурЗакупки/src/InformationRegisters/КонтурЗакупки_СоответствиеНоменклатуры/КонтурЗакупки_СоответствиеНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЗакупки_СоответствиеНоменклатуры</name>
  <attributes>
    <name>ДатаПривязки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОрганизаторЗаказчик</name>
    <type>
      <types>CatalogRef.КонтурЗакупки_ОрганизаторыЗаказчики</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектЗакупки</name>
    <type>
      <types>CatalogRef.КонтурЗакупки_ОбъектыЗакупки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.КонтурЗакупки/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Производитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВесИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесМожноУказыватьВДокументах</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемМожноУказыватьВДокументах</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

УТ.КонтурЗакупки/src/CommonModules/КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера/Module.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область СозданиеСвязанныхОбъектов
	
// Создать задачу сотруднику.
// 
// Параметры:
//  ДокументОснование - ДокументСсылка.КонтурЗакупки_ОбработкаЗакупки - Документ основание
//  ЗадачаСсылка - ДокументСсылка - Задача ссылка
//  ОписаниеРезультата - Строка - Описание результата
// 
// Возвращаемое значение:
//  Булево - Создать задачу сотруднику на сервере
Функция СоздатьЗадачуСотруднику(ДокументОснование, ЗадачаСсылка = Неопределено, ОписаниеРезультата = "") Экспорт
	Продолжать = Истина;

	Если ДокументОснование.Пустая() Тогда
		Продолжать = Ложь;
		ОписаниеРезультата = ОписаниеРезультата + НСтр("ru = 'Исходный документ не записан. Нажмите Записать'")
			+ Символы.ПС;
	КонецЕсли;

	Если Продолжать Тогда
		ДокументЗадачаСотрудникаОбъект = Документы["ЗадачаСотрудника"].СоздатьДокумент();

		СтандартнаяОбработкаПМ = Истина;

		ПараметрыПМ = Новый Структура;
		ПараметрыПМ.Вставить("ОбъектДляЗаполнения", ДокументЗадачаСотрудникаОбъект);
		ПараметрыПМ.Вставить("ДокументОснование", ДокументОснование);

		КонтурЗакупки_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
				"ЗаполнитьДокументЗадачаСотрудника", ПараметрыПМ, СтандартнаяОбработкаПМ);

		Если СтандартнаяОбработкаПМ Тогда
			ЗаполнитьДокументЗадачаСотрудника(ДокументОснование, ДокументЗадачаСотрудникаОбъект);
		КонецЕсли;

		ДокументЗадачаСотрудникаОбъект.Записать();
		ЗадачаСсылка = ДокументЗадачаСотрудникаОбъект.Ссылка;
	КонецЕсли;

	Возврат Продолжать;
КонецФункции
	
// Создать задание.
// 
// Параметры:
//  ДокументОснование - ДокументСсылка.КонтурЗакупки_ОбработкаЗакупки - Документ основание
//  ЗаданиеСсылка - ДокументСсылка - Задание ссылка
//  ОписаниеРезультата - Строка - Описание результата
// 
// Возвращаемое значение:
//  Булево - Создать задание на сервере
Функция СоздатьЗадание(ДокументОснование, ЗаданиеСсылка = Неопределено, ОписаниеРезультата = "") Экспорт
	Продолжать = Истина;
	Если ДокументОснование.Пустая() Тогда
		Продолжать = Ложь;
		ОписаниеРезультата = ОписаниеРезультата + НСтр("ru = 'Исходный документ не записан. Нажмите Записать'")
			+ Символы.ПС;
	КонецЕсли;

	Если Продолжать Тогда
		БПЗаданиеОбъект = БизнесПроцессы["Задание"].СоздатьБизнесПроцесс();

		СтандартнаяОбработкаПМ = Истина;

		ПараметрыПМ = Новый Структура;
		ПараметрыПМ.Вставить("ОбъектДляЗаполнения", БПЗаданиеОбъект);
		ПараметрыПМ.Вставить("ДокументОснование", ДокументОснование);

		КонтурЗакупки_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
				"ЗаполнитьБПЗадание", ПараметрыПМ, СтандартнаяОбработкаПМ);

		Если СтандартнаяОбработкаПМ Тогда
			ЗаполнитьБПЗадание(ДокументОснование, БПЗаданиеОбъект);
		КонецЕсли;

		БПЗаданиеОбъект.Записать();
		ЗаданиеСсылка = БПЗаданиеОбъект.Ссылка;
	КонецЕсли;

	Возврат Продолжать;
КонецФункции
	
// Создать интерес.
// 
// Параметры:
//  ДокументОснование - ДокументСсылка.КонтурЗакупки_ОбработкаЗакупки - Документ основание
//  ИнтересСсылка - ДокументСсылка - Интерес ссылка
//  ОписаниеРезультата - Строка - Описание результата
// 
// Возвращаемое значение:
//  Булево - Создать задание на сервере
Функция СоздатьИнтерес(ДокументОснование, ИнтересСсылка = Неопределено, ОписаниеРезультата = "") Экспорт
	Продолжать = Истина;

	Если ДокументОснование.Пустая() Тогда
		Продолжать = Ложь;
		ОписаниеРезультата = ОписаниеРезультата + НСтр("ru = 'Исходный документ не записан. Нажмите Записать'")
			+ Символы.ПС;
	КонецЕсли;

	Если Продолжать Тогда
		ДокументИнтересОбъект = Документы["CRM_Интерес"].СоздатьДокумент();

		СтандартнаяОбработкаПМ = Истина;

		ПараметрыПМ = Новый Структура;
		ПараметрыПМ.Вставить("ОбъектДляЗаполнения", ДокументИнтересОбъект);
		ПараметрыПМ.Вставить("ДокументОснование", ДокументОснование);

		КонтурЗакупки_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
				"ЗаполнитьДокументИнтерес", ПараметрыПМ, СтандартнаяОбработкаПМ);

		Если СтандартнаяОбработкаПМ Тогда
			ЗаполнитьДокументИнтерес(ДокументОснование, ДокументИнтересОбъект);
		КонецЕсли;

		ДокументИнтересОбъект.Записать();
		ИнтересСсылка = ДокументИнтересОбъект.Ссылка;
	КонецЕсли;

	Возврат Продолжать;
КонецФункции

// Создать сделку.
// 
// Параметры:
//  ДокументОснование - ДокументСсылка.КонтурЗакупки_ОбработкаЗакупки - Документ основание
//  СделкаСсылка - СправочникСсылка.СделкиСКлиентами - Сделка ссылка
//  ОписаниеРезультата - Строка - Описание результата
// 
// Возвращаемое значение:
//  Булево - Создать задание на сервере
Функция СоздатьСделку(ДокументОснование, СделкаСсылка = Неопределено, ОписаниеРезультата = "") Экспорт
	Продолжать = Истина;
	Если ДокументОснование.Пустая() Тогда
		Продолжать = Ложь;
		ОписаниеРезультата = ОписаниеРезультата + НСтр("ru = 'Исходный документ не записан. Нажмите Записать'")
			+ Символы.ПС;
	КонецЕсли;

	Если Продолжать Тогда
		СправочникСделкиСКлиентамиОбъект = Справочники["СделкиСКлиентами"].СоздатьЭлемент();

		СтандартнаяОбработкаПМ = Истина;

		ПараметрыПМ = Новый Структура;
		ПараметрыПМ.Вставить("ОбъектДляЗаполнения", СправочникСделкиСКлиентамиОбъект);
		ПараметрыПМ.Вставить("ДокументОснование", ДокументОснование);

		КонтурЗакупки_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
			"ЗаполнитьСправочникСделкиСКлиентами", ПараметрыПМ, СтандартнаяОбработкаПМ);

		Если СтандартнаяОбработкаПМ Тогда
			ЗаполнитьСправочникСделкиСКлиентами(ДокументОснование, СправочникСделкиСКлиентамиОбъект);
		КонецЕсли;

		СправочникСделкиСКлиентамиОбъект.Записать();
		СделкаСсылка = СправочникСделкиСКлиентамиОбъект.Ссылка;

	КонецЕсли;

	Возврат Продолжать;
КонецФункции

// Создать Заказ Клиента.
// 
// Параметры:
//  ДокументОснование - ДокументСсылка.КонтурЗакупки_ОбработкаЗакупки - Документ основание
//  ЗаказКлиентаСсылка - ДокументСсылка.ЗаказКлиента - ЗаказКлиента ссылка
//  ОписаниеРезультата - Строка - Описание результата
// 
// Возвращаемое значение:
//  Булево - Создать ЗаказКлиента на сервере
Функция СоздатьЗаказКлиента(ДокументОснование, ЗаказКлиентаСсылка = Неопределено, ОписаниеРезультата = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Продолжать = Истина;
	Если ДокументОснование.Пустая() Тогда
		Продолжать = Ложь;
		ОписаниеРезультата = ОписаниеРезультата + НСтр("ru = 'Исходный документ не записан. Нажмите Записать'")
			+ Символы.ПС;
	КонецЕсли;

	Если Продолжать Тогда
		
		ДокументЗаказКлиентаОбъект = Документы["ЗаказКлиента"].СоздатьДокумент();

		СтандартнаяОбработкаПМ = Истина;

		ПараметрыПМ = Новый Структура;
		ПараметрыПМ.Вставить("ОбъектДляЗаполнения", ДокументЗаказКлиентаОбъект);
		ПараметрыПМ.Вставить("ДокументОснование", ДокументОснование);

		КонтурЗакупки_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
			"ЗаполнитьДокументЗаказКлиента", ПараметрыПМ, СтандартнаяОбработкаПМ);

		Если СтандартнаяОбработкаПМ Тогда
			ЗаполнитьДокументЗаказКлиента(ДокументОснование, ДокументЗаказКлиентаОбъект);
		КонецЕсли;

		ДокументЗаказКлиентаОбъект.Записать();
		ЗаказКлиентаСсылка = ДокументЗаказКлиентаОбъект.Ссылка;

	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Продолжать;
	
КонецФункции

#КонецОбласти

#Область ПривязкаДокумента

// Получить закупку из привязки.
// 
// Параметры:
//  ТипОбъекта - Строка - Тип объекта
//  ИдентификаторОбъекта - Строка - Идентификатор объекта
//  Назначение - Строка, Неопределено - Назначение
// 
// Возвращаемое значение:
//  ДокументСсылка.КонтурЗакупки_ОбработкаЗакупки, Неопределено - Получить закупку из привязки
Функция ПолучитьОбработкуЗакупкиИзПривязки(ТипОбъекта, ИдентификаторОбъекта, Назначение = Неопределено) Экспорт
	ДокументОбработкиЗакупки = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЗакупки_ПривязкаОбработкиЗакупки.ОбработкаЗакупки КАК ОбработкаЗакупки
	|ИЗ
	|	РегистрСведений.КонтурЗакупки_ПривязкаОбработкиЗакупки КАК КонтурЗакупки_ПривязкаОбработкиЗакупки
	|ГДЕ
	|	КонтурЗакупки_ПривязкаОбработкиЗакупки.ТипОбъекта = &ТипОбъекта
	|	И КонтурЗакупки_ПривязкаОбработкиЗакупки.ИдентификаторОбъекта = &ИдентификаторОбъекта
	|	И ВЫБОР
	|		КОГДА &ЕстьНазначение
	|			ТОГДА КонтурЗакупки_ПривязкаОбработкиЗакупки.Назначение = &Назначение
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ";

	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
	Запрос.УстановитьПараметр("Назначение", Назначение);
	Запрос.УстановитьПараметр("ЕстьНазначение", Не Назначение = Неопределено);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбработкиЗакупки = Выборка.ОбработкаЗакупки;
	КонецЕсли;

	Возврат ДокументОбработкиЗакупки;
КонецФункции

// Получить ссылку на объект из привязки.
// 
// Параметры:
//  СсылкаНаОбработкуЗакупки - ДокументСсылка.КонтурЗакупки_ОбработкаЗакупки - Ссылка на закупку
//  ТипОбъекта - Строка - Тип объекта
//  Назначение - Строка - Назначение
// 
// Возвращаемое значение:
//  СправочникСсылкаИмяСправочника, ДокументСсылкаИмяДокумента, Неопределено, БизнесПроцессСсылкаИмяБизнесПроцесса - Получить ссылку на объект из привязки
Функция ПолучитьСсылкуНаОбъектИзПривязки(СсылкаНаОбработкуЗакупки, ТипОбъекта, Назначение) Экспорт
	СсылкаНаОбъект = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтурЗакупки_ПривязкаОбработкиЗакупки.ТипОбъекта КАК ТипОбъекта,
	|	КонтурЗакупки_ПривязкаОбработкиЗакупки.ИдентификаторОбъекта КАК ИдентификаторОбъекта
	|ИЗ
	|	РегистрСведений.КонтурЗакупки_ПривязкаОбработкиЗакупки КАК КонтурЗакупки_ПривязкаОбработкиЗакупки
	|ГДЕ
	|	КонтурЗакупки_ПривязкаОбработкиЗакупки.ОбработкаЗакупки = &ОбработкаЗакупки
	|	И КонтурЗакупки_ПривязкаОбработкиЗакупки.Назначение = &Назначение
	|	И КонтурЗакупки_ПривязкаОбработкиЗакупки.ТипОбъекта = &ТипОбъекта";
	Запрос.УстановитьПараметр("ОбработкаЗакупки", СсылкаНаОбработкуЗакупки);
	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);
	Запрос.УстановитьПараметр("Назначение", Назначение);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		МассивТипа = СтрРазделить(ТипОбъекта, ".");
		Если МассивТипа.Количество() = 2 Тогда
			Если МассивТипа[0] = "Справочники" Тогда
				//@skip-check empty-except-statement
				Попытка
					СсылкаНаОбъект = Справочники[МассивТипа[1]].ПолучитьСсылку(
							Новый УникальныйИдентификатор(Выборка.ИдентификаторОбъекта));
				Исключение
				КонецПопытки;
			ИначеЕсли МассивТипа[0] = "Документы" Тогда
				//@skip-check empty-except-statement
				Попытка
					СсылкаНаОбъект = Документы[МассивТипа[1]].ПолучитьСсылку(
							Новый УникальныйИдентификатор(Выборка.ИдентификаторОбъекта));
				Исключение
				КонецПопытки;
			ИначеЕсли МассивТипа[0] = "БизнесПроцессы" Тогда
				//@skip-check empty-except-statement
				Попытка
					СсылкаНаОбъект = БизнесПроцессы[МассивТипа[1]].ПолучитьСсылку(
							Новый УникальныйИдентификатор(Выборка.ИдентификаторОбъекта));
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат СсылкаНаОбъект;
КонецФункции

// Получить массив ссылок на объект из привязки.
// 
// Параметры:
//  СсылкаНаОбработкуЗакупки - ДокументСсылка.КонтурЗакупки_ОбработкаЗакупки - Ссылка на закупку
//  ТипОбъекта - Строка - Тип объекта
//  Назначение - Строка - Назначение
//  ТолькоНеПомеченныеНаУдаление - Булево - Только не помеченные на удаление
// 
// Возвращаемое значение:
//  Неопределено, Массив из СправочникСсылкаИмяСправочника, ДокументСсылкаИмяДокумента, БизнесПроцессСсылкаИмяБизнесПроцесса - Получить ссылку на объект из привязки
Функция ПолучитьМассивСсылокНаОбъектИзПривязки(СсылкаНаОбработкуЗакупки, ТипОбъекта, Назначение = Неопределено,
	ТолькоНеПомеченныеНаУдаление = Истина) Экспорт
	МассивСсылокНаОбъект = Новый Массив; // Массив из Произвольный
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтурЗакупки_ПривязкаОбработкиЗакупки.ТипОбъекта КАК ТипОбъекта,
	|	КонтурЗакупки_ПривязкаОбработкиЗакупки.ИдентификаторОбъекта КАК ИдентификаторОбъекта
	|ИЗ
	|	РегистрСведений.КонтурЗакупки_ПривязкаОбработкиЗакупки КАК КонтурЗакупки_ПривязкаОбработкиЗакупки
	|ГДЕ
	|	КонтурЗакупки_ПривязкаОбработкиЗакупки.ОбработкаЗакупки = &ОбработкаЗакупки
	|	И ВЫБОР
	|		КОГДА &ЕстьНазначение
	|			ТОГДА КонтурЗакупки_ПривязкаОбработкиЗакупки.Назначение = &Назначение
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И КонтурЗакупки_ПривязкаОбработкиЗакупки.ТипОбъекта = &ТипОбъекта";
	Запрос.УстановитьПараметр("ОбработкаЗакупки", СсылкаНаОбработкуЗакупки);
	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);
	Запрос.УстановитьПараметр("Назначение", Назначение);
	Запрос.УстановитьПараметр("ЕстьНазначение", ЗначениеЗаполнено(Назначение));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивТипа = СтрРазделить(ТипОбъекта, ".");
		Если МассивТипа.Количество() = 2 Тогда
			Если МассивТипа[0] = "Справочники" Тогда
				//@skip-check empty-except-statement
				Попытка
					СсылкаНаОбъект = Справочники[МассивТипа[1]].ПолучитьСсылку(
							Новый УникальныйИдентификатор(Выборка.ИдентификаторОбъекта));

					Если ТолькоНеПомеченныеНаУдаление Тогда
						Если Не СсылкаНаОбъект.ПометкаУдаления Тогда
							МассивСсылокНаОбъект.Добавить(СсылкаНаОбъект);
						КонецЕсли;
					Иначе
						МассивСсылокНаОбъект.Добавить(СсылкаНаОбъект);
					КонецЕсли;

				Исключение
				КонецПопытки;
			ИначеЕсли МассивТипа[0] = "Документы" Тогда
				//@skip-check empty-except-statement
				Попытка
					СсылкаНаОбъект = Документы[МассивТипа[1]].ПолучитьСсылку(
							Новый УникальныйИдентификатор(Выборка.ИдентификаторОбъекта));
					Если ТолькоНеПомеченныеНаУдаление Тогда
						Если Не СсылкаНаОбъект.ПометкаУдаления Тогда
							МассивСсылокНаОбъект.Добавить(СсылкаНаОбъект);
						КонецЕсли;
					Иначе
						МассивСсылокНаОбъект.Добавить(СсылкаНаОбъект);
					КонецЕсли;
				Исключение
				КонецПопытки;
			ИначеЕсли МассивТипа[0] = "БизнесПроцессы" Тогда
				//@skip-check empty-except-statement
				Попытка
					СсылкаНаОбъект = БизнесПроцессы[МассивТипа[1]].ПолучитьСсылку(
							Новый УникальныйИдентификатор(Выборка.ИдентификаторОбъекта));
					Если ТолькоНеПомеченныеНаУдаление Тогда
						Если Не СсылкаНаОбъект.ПометкаУдаления Тогда
							МассивСсылокНаОбъект.Добавить(СсылкаНаОбъект);
						КонецЕсли;
					Иначе
						МассивСсылокНаОбъект.Добавить(СсылкаНаОбъект);
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	;
	Возврат МассивСсылокНаОбъект;
КонецФункции

// Создать привязку закупки.
// 
// Параметры:
//  ДокументОснование - ДокументСсылка.КонтурЗакупки_ОбработкаЗакупки - Документ основание
//  ТипОбъекта - Строка - Тип объекта
//  Назначение - Строка - Назначение
//  ИдентификаторОбъекта - Строка, УникальныйИдентификатор - Идентификатор объекта
//  Представление - Строка - Представление
Процедура СоздатьПривязкуОбработкиЗакупки(ДокументОснование, ТипОбъекта, Назначение, ИдентификаторОбъекта,
	Представление = "") Экспорт
	Запись = РегистрыСведений.КонтурЗакупки_ПривязкаОбработкиЗакупки.СоздатьМенеджерЗаписи();
	Запись.ОбработкаЗакупки = ДокументОснование;
	Запись.ТипОбъекта = ТипОбъекта;
	Запись.ИдентификаторОбъекта = ?(ТипЗнч(ИдентификаторОбъекта) = Тип("УникальныйИдентификатор"), XMLСтрока(
		ИдентификаторОбъекта), ИдентификаторОбъекта);
	Запись.Назначение = Назначение;
	Запись.Представление = Представление;
	Запись.Записать();
КонецПроцедуры
#КонецОбласти


// Получить данные Номенклатуры
// 
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - Номенклатура
// 
// Возвращаемое значение:
//  Структура - Номенклатура при изменении на сервере:
// * Производитель - СправочникСсылка.Производители - 
// * Контрагент - СправочникСсылка.Организации, СправочникСсылка.Контрагенты, Неопределено - 
// * Упаковка - СправочникСсылка.УпаковкиЕдиницыИзмерения, Неопределено - 
// * ВесЕдиницы - Число - 
// * ОбъемЕдиницы - Число - 
// * СтавкаНДСПоставщика - ПеречислениеСсылка.КонтурЗакупки_СтавкиНДС - 
// * НормативныйДокумент - Строка - 
// * СтавкаНДСПродажи - ПеречислениеСсылка.КонтурЗакупки_СтавкиНДС - 
Функция ПолучитьДанныеНоменклатуры(Номенклатура) Экспорт
	СтруктураДанныеНоменклатуры = Новый Структура;
	СтруктураДанныеНоменклатуры.Вставить("Производитель", Справочники.Производители.ПустаяСсылка());
	СтруктураДанныеНоменклатуры.Вставить("Контрагент", Неопределено);
	СтруктураДанныеНоменклатуры.Вставить("Упаковка", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
	СтруктураДанныеНоменклатуры.Вставить("ВесЕдиницы", 0);
	СтруктураДанныеНоменклатуры.Вставить("ОбъемЕдиницы", 0);
	СтруктураДанныеНоменклатуры.Вставить("СтавкаНДСПоставщика", Перечисления.КонтурЗакупки_СтавкиНДС.ПустаяСсылка());
	СтруктураДанныеНоменклатуры.Вставить("НормативныйДокумент", "");
	СтруктураДанныеНоменклатуры.Вставить("СтавкаНДСПродажи", Перечисления.КонтурЗакупки_СтавкиНДС.ПустаяСсылка());

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Производитель КАК Производитель,
	|	Номенклатура.Контрагент КАК Контрагент,
	|	Номенклатура.ЕдиницаИзмерения КАК Упаковка,
	|	&СтакаНДСПоУмолчанию КАК СтавкаНДСПоставщика,
	|	&СтакаНДСПродажиПоУмолчанию КАК СтавкаНДСПродажи,
	|	ВЫБОР
	|		КОГДА Номенклатура.ВесИспользовать
	|		И ЕСТЬNULL(Номенклатура.ВесЗнаменатель, 0) <> 0
	|			ТОГДА ВЫРАЗИТЬ(Номенклатура.ВесЧислитель / Номенклатура.ВесЗнаменатель КАК ЧИСЛО(17, 7))
	|	КОНЕЦ КАК ВесЕдиницы,
	|	ВЫБОР
	|		КОГДА Номенклатура.ОбъемИспользовать
	|		И ЕСТЬNULL(Номенклатура.ОбъемЗнаменатель, 0) <> 0
	|			ТОГДА ВЫРАЗИТЬ(Номенклатура.ОбъемЧислитель / Номенклатура.ОбъемЗнаменатель КАК ЧИСЛО(17, 7))
	|	КОНЕЦ КАК ОбъемЕдиницы
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	Запрос.УстановитьПараметр("СтакаНДСПоУмолчанию", КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки(
		"СтакаНДСПоУмолчанию", Перечисления.КонтурЗакупки_СтавкиНДС.ПустаяСсылка()));
	Запрос.УстановитьПараметр("СтакаНДСПродажиПоУмолчанию", КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки(
		"СтакаНДСПродажиПоУмолчанию", Перечисления.КонтурЗакупки_СтавкиНДС.ПустаяСсылка()));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураДанныеНоменклатуры, Выборка);
		СтруктураДанныеНоменклатуры.НормативныйДокумент = УправлениеСвойствами.ЗначениеСвойства(Номенклатура,
			КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки(
		"ПВХНормативныйДокумент", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка()));
	КонецЕсли;

	Возврат СтруктураДанныеНоменклатуры;
КонецФункции

// Получить номенклатуру по объекту закупки.
// 
// Параметры:
//  МассивОрганизаторов - Массив Из СправочникСсылка.КонтурЗакупки_ОрганизаторыЗаказчики -  Массив организаторов
//  ОбъектЗакупки - СправочникСсылка.КонтурЗакупки_ОбъектыЗакупки - Объект закупки
// 
// Возвращаемое значение:
//  СправочникСсылка.Номенклатура - Найденная номенклатура
Функция ПолучитьНоменклатуруПоОбъектуЗакупки(МассивОрганизаторов, ОбъектЗакупки) Экспорт
	Номенклатура = Справочники.Номенклатура.ПустаяСсылка();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтурЗакупки_СоответствиеНоменклатуры.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.КонтурЗакупки_СоответствиеНоменклатуры КАК КонтурЗакупки_СоответствиеНоменклатуры
	|ГДЕ
	|	КонтурЗакупки_СоответствиеНоменклатуры.ОрганизаторЗаказчик В (&МассивОрганизаторЗаказчик)
	|	И КонтурЗакупки_СоответствиеНоменклатуры.ОбъектЗакупки = &ОбъектЗакупки
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтурЗакупки_СоответствиеНоменклатуры.ДатаПривязки УБЫВ";
	Запрос.УстановитьПараметр("МассивОрганизаторЗаказчик", МассивОрганизаторов);
	Запрос.УстановитьПараметр("ОбъектЗакупки", ОбъектЗакупки);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Номенклатура = Выборка.Номенклатура;
	КонецЕсли;

	Возврат Номенклатура;
КонецФункции

// Записать номенклатуру по объекту закупки.
// 
// Параметры:
//  МассивОрганизаторов - Массив Из СправочникСсылка.КонтурЗакупки_ОрганизаторыЗаказчики - Массив организаторов
//  ОбъектЗакупки - СправочникСсылка.КонтурЗакупки_ОбъектыЗакупки - Объект закупки
//  Номенклатура - СправочникСсылка.Номенклатура - Номенклатура
Процедура ЗаписатьНоменклатуруПоОбъектуЗакупки(МассивОрганизаторов, ОбъектЗакупки, Номенклатура) Экспорт

	Для Каждого Организатор Из МассивОрганизаторов Цикл
		Запись = РегистрыСведений.КонтурЗакупки_СоответствиеНоменклатуры.СоздатьМенеджерЗаписи();
		Запись.ОрганизаторЗаказчик = Организатор;
		Запись.ОбъектЗакупки = ОбъектЗакупки;
		Запись.Номенклатура = Номенклатура;
		Запись.ДатаПривязки = ТекущаяДатаСеанса();
		Запись.Записать();
	КонецЦикла;

КонецПроцедуры

// Создать задание обработки закупки.
// 
// Параметры:
//  ДокументОснование - ДокументСсылка.КонтурЗакупки_ОбработкаЗакупки - Документ основание
//  Назначение - Строка - Назначение задания
//  ПараметрыЗадания - Структура из Неопределено - Параметры задания
//  ЗаданиеСсылка - ДокументСсылка - Задание ссылка
//  ОписаниеРезультата - Строка - Описание результата
// 
// Возвращаемое значение:
//  Булево - Создать задание на сервере
Функция СоздатьЗаданиеОбработкиЗакупки(ДокументОснование, Назначение, ПараметрыЗадания, ЗаданиеСсылка = Неопределено,
	ОписаниеРезультата = "") Экспорт
	Продолжать = Истина;
	ТипОбъекта = КонтурЗакупки_ЛокализацияВызовСервера.ПредставлениеТипаЗадание();
	Если ДокументОснование.Пустая() Тогда
		Продолжать = Ложь;
		ОписаниеРезультата = ОписаниеРезультата + НСтр("ru = 'Исходный документ не записан. Нажмите Записать'")
			+ Символы.ПС;
	КонецЕсли;

	Если Продолжать Тогда
		Задание = БизнесПроцессы["Задание"].СоздатьБизнесПроцесс();
		Задание.Дата = ТекущаяДатаСеанса();
		Задание.Заполнить(ДокументОснование);
		Задание.Содержание = СтрШаблон(НСтр("ru = 'Обработать документ обработка закупки: %1'"), Строка(
			ДокументОснование));
		Задание.Записать();
		Задание.Старт();

		ЗаданиеСсылка = Задание.Ссылка;

		СоздатьПривязкуОбработкиЗакупки(ДокументОснование, ТипОбъекта, Назначение, XMLСтрока(
			ЗаданиеСсылка.УникальныйИдентификатор()), Строка(ЗаданиеСсылка));

	КонецЕсли;

	Возврат Продолжать;
КонецФункции
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьБПЗадание(ЗакупкаСсылка, БПЗаданиеОбъект)
	БПЗаданиеОбъект.Дата = ТекущаяДатаСеанса();
	БПЗаданиеОбъект.Заполнить(ЗакупкаСсылка);
	БПЗаданиеОбъект.Содержание = СтрШаблон(НСтр("ru = 'Обработать документ закупки: %1'"), Строка(ЗакупкаСсылка));
КонецПроцедуры

Процедура ЗаполнитьДокументИнтерес(ЗакупкаСсылка, ДокументИнтересОбъект)
	ДокументИнтересОбъект.Дата = ТекущаяДатаСеанса();
	ДокументИнтересОбъект.Заполнить(ЗакупкаСсылка);
	ДокументИнтересОбъект.Описание = СтрШаблон(НСтр("ru = 'Обработать документ закупки: %1'"), Строка(ЗакупкаСсылка));
	ДокументИнтересОбъект.ОжидаемаяВыручка = ЗакупкаСсылка.НМЦЗакупки;
	ДокументИнтересОбъект.ОжидаемаяДатаПродажи = ЗакупкаСсылка.ДатаОкончанияПодачиЗаявок;
	ДокументИнтересОбъект.Тема = ЗакупкаСсылка.ОрганизаторНаименование + " / " + ЗакупкаСсылка.ИмяОписаниеЗакупки;
КонецПроцедуры

Процедура ЗаполнитьДокументЗадачаСотрудника(ЗакупкаСсылка, ДокументЗадачаСотрудникаОбъект)
	ДокументЗадачаСотрудникаОбъект.Дата = ТекущаяДатаСеанса();
	ДокументЗадачаСотрудникаОбъект.Заполнить(ЗакупкаСсылка);
	ДокументЗадачаСотрудникаОбъект.Описание = СтрШаблон(НСтр("ru = 'Обработать документ закупки: %1'"), Строка(
		ЗакупкаСсылка));
КонецПроцедуры

#Область ЗаполнениеЗаказКлиента
// Заполнить документ ЗаказКлиента.
// 
// Параметры:
//  ОбработкаЗакупкиСсылка - ДокументСсылка.КонтурЗакупки_ОбработкаЗакупки - Закупка ссылка
//  ДокументЗаказКлиентаОбъект - ДокументОбъект.ЗаказКлиента - Документ ЗаказКлиента
// 
// Возвращаемое значение:
//  СправочникОбъект.СделкиСКлиентами - Заполнить справочник сделки с клиентами
Функция ЗаполнитьДокументЗаказКлиента(ОбработкаЗакупкиСсылка, ДокументЗаказКлиентаОбъект)
	
	// Инициализация заказа клиента
	ДокументЗаказКлиентаОбъект.Заполнить(Неопределено);
	
	Партнер = Неопределено;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КонтурЗакупки_ОбработкаЗакупкиОрганизаторыЗаказчики.ОрганизаторЗаказчик.ИНН КАК ОрганизаторЗаказчикИНН,
	|	КонтурЗакупки_ОбработкаЗакупкиОрганизаторыЗаказчики.ОрганизаторЗаказчик.КПП КАК ОрганизаторЗаказчикКПП,
	|	КонтурЗакупки_ОбработкаЗакупкиОрганизаторыЗаказчики.ОрганизаторЗаказчик.ПолноеНаименование КАК
	|		ОрганизаторЗаказчикПолноеНаименование
	|ИЗ
	|	Документ.КонтурЗакупки_ОбработкаЗакупки.ОрганизаторыЗаказчики КАК КонтурЗакупки_ОбработкаЗакупкиОрганизаторыЗаказчики
	|ГДЕ
	|	КонтурЗакупки_ОбработкаЗакупкиОрганизаторыЗаказчики.ЭтоОрганизатор
	|	И КонтурЗакупки_ОбработкаЗакупкиОрганизаторыЗаказчики.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ОбработкаЗакупкиСсылка);

	Выборка = Запрос.Выполнить().Выбрать();

	ОрганизаторНаименование = "";
	ОрганизаторИНН = "";
	ОрганизаторКПП = "";
	Если Выборка.Следующий() Тогда
		ОрганизаторНаименование = Выборка.ОрганизаторЗаказчикПолноеНаименование;
		ОрганизаторИНН = Выборка.ОрганизаторЗаказчикИНН;
		ОрганизаторКПП = Выборка.ОрганизаторЗаказчикКПП;
	КонецЕсли;

	Контрагент = ПолучитьКонтрагента(ОрганизаторИНН, ОрганизаторКПП);
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Партнер = Контрагент.Партнер;
	КонецЕсли;

	Если Истина Тогда
		СтруктураПартнера = Новый Структура;
		СтруктураПартнера.Вставить("Комментарий", НСтр("ru = '#Создан автоматически из закупки'"));

		СтруктураПартнера.Вставить("НаименованиеПолное", ОрганизаторНаименование);
		СтруктураПартнера.Вставить("Наименование", ОрганизаторНаименование);
		СтруктураПартнера.Вставить("ДатаРегистрации", ТекущаяДатаСеанса());
		СтруктураПартнера.Вставить("ПрочиеОтношения", Истина);
		СтруктураПартнера.Вставить("ЮрФизЛицо", Перечисления.КомпанияЧастноеЛицо.Компания);

		СтруктураКонтактнаяИнформацияПартнера = Новый Структура;
		Если Не ПустаяСтрока(ОбработкаЗакупкиСсылка.ДокументОснования.КонтактныеДанныеТелефон) Тогда
			СтруктураКонтактнаяИнформацияПартнера.Вставить("ТелефонКонтактногоЛица",
				ОбработкаЗакупкиСсылка.ДокументОснования.КонтактныеДанныеТелефон);
		КонецЕсли;
		Если Не ПустаяСтрока(ОбработкаЗакупкиСсылка.ДокументОснования.КонтактныеДанныеЭлектроннаяПочта) Тогда
			СтруктураКонтактнаяИнформацияПартнера.Вставить("EmailКонтактногоЛица",
				ОбработкаЗакупкиСсылка.ДокументОснования.КонтактныеДанныеЭлектроннаяПочта);
		КонецЕсли;
		Если Не ПустаяСтрока(ОбработкаЗакупкиСсылка.ДокументОснования.КонтактныеДанныеИмя) Тогда
			СтруктураКонтактнаяИнформацияПартнера.Вставить("КонтактноеЛицо",
				ОбработкаЗакупкиСсылка.ДокументОснования.КонтактныеДанныеИмя);
		КонецЕсли;
		СтруктураПартнера.Вставить("КонтактнаяИнформация", СтруктураКонтактнаяИнформацияПартнера);

		Партнер = НайтиСоздатьПартнера(СтруктураПартнера);
	КонецЕсли;

	ДокументЗаказКлиентаОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
	ДокументЗаказКлиентаОбъект.Контрагент = Контрагент;
	ДокументЗаказКлиентаОбъект.Партнер = Партнер;
	ДокументЗаказКлиентаОбъект.Дата = ТекущаяДатаСеанса();
	ДокументЗаказКлиентаОбъект.Валюта = ПолучитьВалютуПоСимвКоду(?(Не ПустаяСтрока(
		ОбработкаЗакупкиСсылка.ДокументОснования.Валюта), ОбработкаЗакупкиСсылка.ДокументОснования.Валюта, "RUB"));
	ДокументЗаказКлиентаОбъект.Комментарий = СтрШаблон(
			НСтр("ru = '#Создано автоматически на основании закупки %1 от %2'"),
		ОбработкаЗакупкиСсылка.ДокументОснования.НомерЗакупки, Формат(
		ОбработкаЗакупкиСсылка.ДокументОснования.ДатаСозданияЗакупки, "ДЛФ=DDT"));
	ЗаполнитьДокументЗаказКлиента_Товары(ОбработкаЗакупкиСсылка, ДокументЗаказКлиентаОбъект);

	Возврат ДокументЗаказКлиентаОбъект;
КонецФункции

Процедура ЗаполнитьДокументЗаказКлиента_Товары(ОбработкаЗакупкиСсылка, ЗаказКлиентаОбъект)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.Номенклатура,
	|	КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.СуммаПродажи КАК Сумма,
	|	КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.ЦенаПродажи КАК Цена,
	|	КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.Количество КАК КоличествоУпаковок,
	|	КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.Упаковка КАК Упаковка
	|ИЗ
	|	Документ.КонтурЗакупки_ОбработкаЗакупки.ОбъектыЗакупки КАК КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки
	|ГДЕ
	|	КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.Ссылка = &Ссылка
	|	И КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.ПозицияВыиграна";

	Запрос.УстановитьПараметр("Ссылка", ОбработкаЗакупкиСсылка);

	ЗаказКлиентаОбъект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеСделки

// Заполнить справочник сделки с клиентами.
// 
// Параметры:
//  ОбработкаЗакупкиСсылка - ДокументСсылка.КонтурЗакупки_ОбработкаЗакупки - Закупка ссылка
//  СправочникСделкиСКлиентамиОбъект - СправочникОбъект.СделкиСКлиентами - Справочник сделки с клиентами объект
// 
// Возвращаемое значение:
//  СправочникОбъект.СделкиСКлиентами - Заполнить справочник сделки с клиентами
Функция ЗаполнитьСправочникСделкиСКлиентами(ОбработкаЗакупкиСсылка, СправочникСделкиСКлиентамиОбъект)
	Партнер = Неопределено;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КонтурЗакупки_ОбработкаЗакупкиОрганизаторыЗаказчики.ОрганизаторЗаказчик.ИНН КАК ОрганизаторЗаказчикИНН,
	|	КонтурЗакупки_ОбработкаЗакупкиОрганизаторыЗаказчики.ОрганизаторЗаказчик.КПП КАК ОрганизаторЗаказчикКПП,
	|	КонтурЗакупки_ОбработкаЗакупкиОрганизаторыЗаказчики.ОрганизаторЗаказчик.ПолноеНаименование КАК
	|		ОрганизаторЗаказчикПолноеНаименование
	|ИЗ
	|	Документ.КонтурЗакупки_ОбработкаЗакупки.ОрганизаторыЗаказчики КАК КонтурЗакупки_ОбработкаЗакупкиОрганизаторыЗаказчики
	|ГДЕ
	|	КонтурЗакупки_ОбработкаЗакупкиОрганизаторыЗаказчики.ЭтоОрганизатор
	|	И КонтурЗакупки_ОбработкаЗакупкиОрганизаторыЗаказчики.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ОбработкаЗакупкиСсылка);

	Выборка = Запрос.Выполнить().Выбрать();

	ОрганизаторНаименование = "";
	ОрганизаторИНН = "";
	ОрганизаторКПП = "";
	Если Выборка.Следующий() Тогда
		ОрганизаторНаименование = Выборка.ОрганизаторЗаказчикПолноеНаименование;
		ОрганизаторИНН = Выборка.ОрганизаторЗаказчикИНН;
		ОрганизаторКПП = Выборка.ОрганизаторЗаказчикКПП;
	КонецЕсли;

	Контрагент = ПолучитьКонтрагента(ОрганизаторИНН, ОрганизаторКПП);
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Партнер = Контрагент.Партнер;
	КонецЕсли;

	Если Истина Тогда
		СтруктураПартнера = Новый Структура;
		СтруктураПартнера.Вставить("Комментарий", НСтр("ru = '#Создан автоматически из закупки'"));

		СтруктураПартнера.Вставить("НаименованиеПолное", ОрганизаторНаименование);
		СтруктураПартнера.Вставить("Наименование", ОрганизаторНаименование);
		СтруктураПартнера.Вставить("ДатаРегистрации", ТекущаяДатаСеанса());
		СтруктураПартнера.Вставить("ПрочиеОтношения", Истина);
		СтруктураПартнера.Вставить("ЮрФизЛицо", Перечисления.КомпанияЧастноеЛицо.Компания);

		СтруктураКонтактнаяИнформацияПартнера = Новый Структура;
		Если Не ПустаяСтрока(ОбработкаЗакупкиСсылка.ДокументОснования.КонтактныеДанныеТелефон) Тогда
			СтруктураКонтактнаяИнформацияПартнера.Вставить("ТелефонКонтактногоЛица",
				ОбработкаЗакупкиСсылка.ДокументОснования.КонтактныеДанныеТелефон);
		КонецЕсли;
		Если Не ПустаяСтрока(ОбработкаЗакупкиСсылка.ДокументОснования.КонтактныеДанныеЭлектроннаяПочта) Тогда
			СтруктураКонтактнаяИнформацияПартнера.Вставить("EmailКонтактногоЛица",
				ОбработкаЗакупкиСсылка.ДокументОснования.КонтактныеДанныеЭлектроннаяПочта);
		КонецЕсли;
		Если Не ПустаяСтрока(ОбработкаЗакупкиСсылка.ДокументОснования.КонтактныеДанныеИмя) Тогда
			СтруктураКонтактнаяИнформацияПартнера.Вставить("КонтактноеЛицо",
				ОбработкаЗакупкиСсылка.ДокументОснования.КонтактныеДанныеИмя);
		КонецЕсли;
		СтруктураПартнера.Вставить("КонтактнаяИнформация", СтруктураКонтактнаяИнформацияПартнера);

		Партнер = НайтиСоздатьПартнера(СтруктураПартнера);
	КонецЕсли;

	СправочникСделкиСКлиентамиОбъект.Партнер = Партнер;
	СправочникСделкиСКлиентамиОбъект.Статус = Перечисления.СтатусыСделок.ВРаботе;
	СправочникСделкиСКлиентамиОбъект.Комментарий = СтрШаблон(
			НСтр("ru = '#Создано автоматически на основании закупки %1 от %2'"),
		ОбработкаЗакупкиСсылка.ДокументОснования.НомерЗакупки, Формат(
		ОбработкаЗакупкиСсылка.ДокументОснования.ДатаСозданияЗакупки, "ДЛФ=DDT"));
	СправочникСделкиСКлиентамиОбъект.Наименование = ОбработкаЗакупкиСсылка.ДокументОснования.ИмяОписаниеЗакупки;
	СправочникСделкиСКлиентамиОбъект.ВалютаПервичногоСпроса = ПолучитьВалютуПоСимвКоду(?(Не ПустаяСтрока(
		ОбработкаЗакупкиСсылка.ДокументОснования.Валюта), ОбработкаЗакупкиСсылка.ДокументОснования.Валюта, "RUB"));
	ЗаполнитьПервичныйСпрос(ОбработкаЗакупкиСсылка, СправочникСделкиСКлиентамиОбъект);

	Возврат СправочникСделкиСКлиентамиОбъект;
КонецФункции

Процедура ЗаполнитьПервичныйСпрос(ОбработкаЗакупкиСсылка, СделкаОбъект)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.НаименованиеОбъектаЗакупки = """"
	|			ТОГДА КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.НаименованиеОбъектаЗакупки
	|		ИНАЧЕ ВЫБОР
	|			КОГДА НЕ КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.ОКПД2Код = """"
	|				ТОГДА КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.ОКПД2Расшифровка
	|			ИНАЧЕ """"
	|		КОНЕЦ + ВЫБОР
	|			КОГДА НЕ КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.КТРУКод = """"
	|				ТОГДА КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.КТРУРасшифровка
	|			ИНАЧЕ """"
	|		КОНЕЦ + ВЫБОР
	|			КОГДА НЕ КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.ОКВЭД2Код = """"
	|				ТОГДА КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.ОКВЭД2Расшифровка
	|			ИНАЧЕ """"
	|		КОНЕЦ
	|	КОНЕЦ КАК ТекстовоеОписание,
	|	КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.ОбщаяСтоимостьОбъекта КАК Сумма,
	|	ВЫБОР
	|		КОГДА НЕ КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.ОКПД2Код = """"
	|			ТОГДА ""ОКПД2 "" + КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.ОКПД2Код + "" "" +
	|				КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.ОКПД2Расшифровка + "" | ""
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА НЕ КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.КТРУКод = """"
	|			ТОГДА ""КТРУ "" + КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.КТРУКод + "" "" +
	|				КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.КТРУРасшифровка + "" | ""
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА НЕ КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.ОКВЭД2Код = """"
	|			ТОГДА ""ОКВЭД2 "" + КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.ОКВЭД2Код + "" "" +
	|				КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.ОКВЭД2Расшифровка
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Комментарий
	|ИЗ
	|	Документ.КонтурЗакупки_ОбработкаЗакупки.ОбъектыЗакупки КАК КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки
	|ГДЕ
	|	КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.Ссылка = &Ссылка
	|	И КонтурЗакупки_ОбработкаЗакупкиТабличнаяЧастьОбъектыЗакупки.ПозицияВыиграна";

	Запрос.УстановитьПараметр("Ссылка", ОбработкаЗакупкиСсылка);

	СделкаОбъект.ПервичныйСпрос.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

Функция ПолучитьВалютуПоСимвКоду(СимвКод)
	ВозвратВалюта = Справочники.Валюты.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Валюты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.Наименование = &Наименование";

	Запрос.УстановитьПараметр("Наименование", СимвКод);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВозвратВалюта = Выборка.Ссылка;
	КонецЕсли;

	Возврат ВозвратВалюта;

КонецФункции

Функция НайтиСоздатьПартнера(СтруктураПартнера)
	// обрежем, наименование, что бы искать по полному и не создать дубликат
	ВозвратПартнер = ПолучитьПартнера(Лев(СтруктураПартнера.НаименованиеПолное, 250));
	Если ЗначениеЗаполнено(ВозвратПартнер) Тогда
		НовПартнер = ВозвратПартнер.ПолучитьОбъект();
	Иначе
		НовПартнер = Справочники["Партнеры"].СоздатьЭлемент();
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(НовПартнер, СтруктураПартнера);

	Попытка
		НовПартнер.Записать();
		ВозвратПартнер = НовПартнер.Ссылка;
	Исключение
	КонецПопытки;

	СтруктураКИ = СтруктураПартнера.КонтактнаяИнформация;

	Если ЗначениеЗаполнено(ВозвратПартнер) И СтруктураКИ.Количество() > 0 Тогда
		НовоеКЛ = Справочники["КонтактныеЛицаПартнеров"].СоздатьЭлемент();
		НовоеКЛ.Владелец = ВозвратПартнер;

		Если СтруктураКИ.Свойство("КонтактноеЛицо") Тогда
			НовоеКЛ.Наименование = СтруктураПартнера.КонтактнаяИнформация["КонтактноеЛицо"];
		Иначе
			НовоеКЛ.Наименование = "Не указано";
		КонецЕсли;

		ЕстьОМ_УКИ = Истина;

		Попытка
			ОМУправлениеКонтактнойИнформацией = КонтурЗакупки_ОбщегоНазначения.ОбщийМодуль(
			"УправлениеКонтактнойИнформацией");
		Исключение
			ЕстьОМ_УКИ = Ложь;
		КонецПопытки;

		Если ЕстьОМ_УКИ Тогда
			Если СтруктураКИ.Свойство("ТелефонКонтактногоЛица") Тогда
				ОМУправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(НовоеКЛ,
					СтруктураКИ["ТелефонКонтактногоЛица"],
					Справочники["ВидыКонтактнойИнформации"].ТелефонКонтактногоЛица);
			КонецЕсли;

			Если СтруктураКИ.Свойство("EmailКонтактногоЛица") Тогда
				ОМУправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(НовоеКЛ,
					СтруктураКИ["EmailКонтактногоЛица"], Справочники["ВидыКонтактнойИнформации"].EmailКонтактногоЛица);
			КонецЕсли;

		КонецЕсли;
		НовоеКЛ.Записать();
	КонецЕсли;

	Возврат ВозвратПартнер;
КонецФункции

Функция ПолучитьКонтрагента(ИНН, КПП)
	ВозвратКонтрагент = Справочники["Контрагенты"].ПустаяСсылка();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН = &ИНН
	|	И Контрагенты.КПП = &КПП";
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("КПП", КПП);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВозвратКонтрагент = Выборка.Ссылка;
	КонецЕсли;

	Возврат ВозвратКонтрагент;
КонецФункции

Функция ПолучитьПартнера(НаименованиеПолное)
	ВозвратПартнер = Справочники["Партнеры"].ПустаяСсылка();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Партнеры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|ГДЕ
	|	Партнеры.НаименованиеПолное = &НаименованиеПолное";
	Запрос.УстановитьПараметр("НаименованиеПолное", НаименованиеПолное);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВозвратПартнер = Выборка.Ссылка;
	КонецЕсли;

	Возврат ВозвратПартнер;
КонецФункции
#КонецОбласти
#КонецОбласти
#КонецЕсли
